/*
 Copyright 2009-2015 Urban Airship Inc. All rights reserved.
 
 Redistribution and use in source and binary forms, with or without
 modification, are permitted provided that the following conditions are met:
 
 1. Redistributions of source code must retain the above copyright notice, this
 list of conditions and the following disclaimer.
 
 2. Redistributions in binary form must reproduce the above copyright notice,
 this list of conditions and the following disclaimer in the documentation 
 and/or other materials provided with the distribution.
 
 THIS SOFTWARE IS PROVIDED BY THE URBAN AIRSHIP INC ``AS IS'' AND ANY EXPRESS OR
 IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO
 EVENT SHALL URBAN AIRSHIP INC OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
 INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
 OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
 ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */


/* Push Settings Screen */
"UA_Push_Settings_Title" = "Push Settings";

"UA_Push_Settings_Enabled_Label" = "Push Enabled";
"UA_Push_Settings_Location_Enabled_Label" = "Location Enabled";
"UA_Push_Settings_Analytics_Enabled_Label" = "Don't send usage data";
"UA_Push_Settings_Quiet_Time_Label" = "Quiet Time";
"UA_Quiet_Time_From" = "From";
"UA_Quiet_Time_To" = "To";

/* Notification Handler */
"UA_Notification_Title" = "Notification";

/* Notification Types */
"UA_Notification_Type_Badges" = "Badges";
"UA_Notification_Type_Alerts" = "Alerts";
"UA_Notification_Type_Sounds" = "Sounds";

"UA_Push_Settings_Link_Disabled_Title" = "⚠ Push is Disabled with iOS";
"UA_Push_Settings_Link_Disabled_Detail" = "Open System Settings to Enable Notifications";

"UA_Push_Settings_Link_Partially_Disabled_Title" = "Update System Settings";
"UA_Push_Settings_Link_Partially_Disabled_Detail" = "Not all notification types are enabled";

"UA_Push_Settings_Link_Title" = "Update System Push Settings";
"UA_Push_settings_Link_Detail" = "Change banner and lock screen settings";

"None" = "None";